// 정수를 저장한 배열, arr 에서 가장 작은 수를 제거한 배열을 리턴하는 함수, solution을 완성해주세요.
// 단, 리턴하려는 배열이 빈 배열인 경우엔 배열에 -1을 채워 리턴하세요.
// 예를들어 arr이 [4,3,2,1]인 경우는 [4,3,2]를 리턴 하고, [10]면 [-1]을 리턴 합니다.

// 제한 조건
// arr은 길이 1 이상인 배열입니다.
// 인덱스 i, j에 대해 i ≠ j이면 arr[i] ≠ arr[j] 입니다.

// 입출력 예
// arr	return
//[4, 3, 2, 1][(4, 3, 2)][10][-1];

function solution(arr) {
  const arr2 = arr.slice();
  // 배열을 복사하게 되면 참조값을 복사하기때문에 실제로 수정시 두배열 모두 수정된다.
  // slice메소드를 사용하면 배열값을 추출해서 복사할수 있습니다.

  const arrMin = arr.indexOf(arr2.sort((a, b) => a - b)[0]);
  // 전달받은 배열의 가장 작은값의 인덱스를 구하기위해
  // 복사한 배열을 오름차순으로 정렬하고 첫번째 값 즉 제일 작은값을구한뒤 indexOf메소드의 인자로 넘겨줍니다.
  // arrMin 변수에 가장작은값의 인덱스가 들어가게 되고

  arr.splice(arrMin, 1);
  // splice 메소드를사용해서 인덱스위치에서부터 하나의 값 을 삭제 합니다.

  const answer = arr.length < 1 ? [-1] : arr;
  // 배열의 크기가 1보다 작다면 [-1] 배열을 리턴합니다.

  // 문제 풀이후 본 인상적인 답
  // Math객체를 사용해서 Math.min(...arr) 최소값을 구할수 있다.
  return answer;
}
